
const areaCodeMap = {
    FR: '33',       //法国
    GB: '44',       //英国
    CH: '41',       //瑞士
    DE: '49',       //德国
    ES: '34',       //西班牙
    IT: '39',       //意大利
    GR: '30',       //希腊
    SE: '46',       //瑞典
    NL: '31',       //荷兰
    NO: '47',       //挪威
    DK: '45',       //丹麦
    AT: '43',       //奥地利
    BE: '32',       //比利时
    HU: '36',       //匈牙利
    RO: '40',       //罗马尼亚
    MC: '377',      //摩纳哥
    CZ: '420',      //捷克
    HR: '385',      //克罗地亚
    MK: '389',      //马其顿
    CY: '357',      //塞浦路斯
    IE: '353',      //爱尔兰
    PT: '351',      //葡萄牙
    FI: '358',      //芬兰
    GI: '350',      //直布罗陀
    IS: '354',      //冰岛
    RS: '381',      //塞尔维亚
    SI: '386',      //斯洛文尼亚
    SK: '421',      //斯洛伐克
    LI: '423',      //列支敦士登
    LU: '352',      //卢森堡
    BG: '359',      //保加利亚
    MA: '212',      //摩洛哥    
}

module.exports = class AreaCode {
    static get(country){
        return areaCodeMap[country]||'';
    }
}